EDT/УТ/src/Documents/мгДепримирование/мгДепримирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгДепримирование</name>
  <registerRecords>AccumulationRegister.мгЗарплатаУдержания</registerRecords>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/РаботникиОрганизации/РаботникиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизации</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетВПроектнойДеятельности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафикУчетаРабочегоВремени</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаНачисления/мгЗарплатаНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаНачисления</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/ТипыЗаказов/ТипыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказов</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Обмен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/УвольнениеСРаботыИзОрганизация/УвольнениеСРаботыИзОрганизация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УвольнениеСРаботыИзОрганизация</name>
  <registerRecords>InformationRegister.РаботникиОрганизации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/ДолжностиОрганизаций/ДолжностиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДолжностиОрганизаций</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>ВечернийВодитель</name>
      <description>Вечерний водитель</description>
    </items>
    <items>
      <name>ВодительЗаборщик</name>
      <description>Водитель-заборщик</description>
    </items>
    <items>
      <name>ДежурныйВодитель</name>
      <description>Дежурный водитель</description>
    </items>
    <items>
      <name>Диспетчер</name>
      <description>Диспетчер</description>
    </items>
    <items>
      <name>Логист</name>
      <description>Логист</description>
    </items>
    <items>
      <name>Магистраль</name>
      <description>Магистраль</description>
    </items>
    <items>
      <name>НаемныйВодитель</name>
      <description>Наемный водитель</description>
    </items>
    <items>
      <name>ПешийКурьер</name>
      <description>Пеший курьер</description>
    </items>
    <items>
      <name>Самовывоз</name>
      <description>Самовывоз</description>
    </items>
    <items>
      <name>Фрахты</name>
      <description>Фрахты</description>
    </items>
    <items>
      <name>ШтатныйВодитель</name>
      <description>Штатный водитель</description>
    </items>
    <items>
      <name>Экспедитор</name>
      <description>Экспедитор</description>
    </items>
  </predefined>
  <attributes>
    <name>РольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ПричиныНеВыполненияДоставки/ПричиныНеВыполненияДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныНеВыполненияДоставки</name>
  <predefined>
    <items>
      <name>НеДоставлен</name>
      <description>Не доставлен</description>
    </items>
    <items>
      <name>НетНаСкладе</name>
      <description>Нет на складе</description>
    </items>
    <items>
      <name>ОтказКлиентаБезЗаезда</name>
      <description>Отказ клиента без заезда</description>
    </items>
    <items>
      <name>ОтказКлиентаСЗаездом</name>
      <description>Отказ клиента с заездом</description>
    </items>
    <items>
      <name>ПереносДоставки</name>
      <description>Перенос доставки</description>
    </items>
    <items>
      <name>ПереносНаВторуюОчередь</name>
      <description>Перенос на вторую очередь (без заезда)</description>
    </items>
    <items>
      <name>ПереносСЗаездом</name>
      <description>Перенос с заездом</description>
    </items>
  </predefined>
  <attributes>
    <name>Перенос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВМобильномПриложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заезд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАдминки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьВводПричиныОтказаПереноса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаРезультатМестнойДоставки/новаРезультатМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаРезультатМестнойДоставки</name>
  <predefined>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>ВыполненаЧастично</name>
      <description>Выполнена частично</description>
    </items>
    <items>
      <name>НеВыполнена</name>
      <description>Не выполнена</description>
    </items>
  </predefined>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.новаРезультатВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныНеВыполнения</name>
    <type>
      <types>CatalogRef.новаПричиныНеВыполненияМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплатыВодителю</name>
    <comment>Если выполнена 100%</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПосещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаВодители/новаВодители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаВодители</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнешняяМаршрутизация</name>
      <description>Внешняя маршрутизация</description>
    </items>
  </predefined>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентОпытности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наемный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТранспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТелефон</name>
    <type>
      <types>CatalogRef.новаКонтактнаяИнформация</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЭлектроннаяПочта</name>
    <type>
      <types>CatalogRef.новаКонтактнаяИнформация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРНИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПешийКурьер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДВнешнегоОператораМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Районы</name>
    <attributes>
      <name>Район</name>
      <type>
        <types>CatalogRef.новаГеоРайоны</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентОпытности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Documents/мгДепримирование/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Данные.Количество() <> 0 тогда
		От = Вопрос("Табличная часть не пуста. При заполнении она будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если От = КодВозвратаДиалога.Да Тогда
			Объект.Данные.Очистить();
		Иначе
			Возврат;
		КонецеСли;	
	КонецЕсли;
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(РаботникиОрганизации.Период) КАК Период
	|ПОМЕСТИТЬ вр_РаботникиОрганизации
	|ИЗ
	|	РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизации.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	вр_РаботникиОрганизации.Период КАК Период,
	|	РаботникиОрганизации.Организация КАК Организация,
	|	РаботникиОрганизации.Состояние КАК Состояние,
	|	РаботникиОрганизации.Должность КАК Должность
	|ПОМЕСТИТЬ втРаботники
	|ИЗ
	|	вр_РаботникиОрганизации КАК вр_РаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизации КАК РаботникиОрганизации
	|		ПО вр_РаботникиОрганизации.Сотрудник = РаботникиОрганизации.Сотрудник
	|			И вр_РаботникиОрганизации.Период = РаботникиОрганизации.Период
	|ГДЕ
	|	НЕ РаботникиОрганизации.Регистратор ССЫЛКА Документ.УвольнениеСРаботыИзОрганизация
	|	И НЕ РаботникиОрганизации.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ВодительЗаборщик)
	|	И НЕ ЕСТЬNULL(РаботникиОрганизации.Сотрудник.ПешийКурьер, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка КАК Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки КАК НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа КАК ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Водитель КАК Сотрудник,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки КАК РезультатДоставки,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	|		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	|	КОНЕЦ КАК ПричинаНевыполнения,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеЗаказовЗаказы.Реализация.Дата, ДЕНЬ) КАК ОтработанныйДень,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда)
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ПустаяСсылка)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
	|				И ЗакрытиеЗаказовЗаказы.Закрыть
	|			ТОГДА 1
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВыполненныйЗаказ
	|ПОМЕСТИТЬ втЗаказыВыполненные
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &Терминал
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Экспедитор,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки,
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки
	|		ИНАЧЕ ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(ЗакрытиеЗаказовЗаказы.Реализация.Дата, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаСЗаездом)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗакрытиеЗаказовЗаказы.ДанныеМПВодителя.ПричинаНеВыполненияДоставки = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ОтказКлиентаБезЗаезда)
	|						ТОГДА 0
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		КОГДА (ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.Выполнена)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ПустаяСсылка)
	|				ИЛИ ЗакрытиеЗаказовЗаказы.РезультатДоставки = ЗНАЧЕНИЕ(Справочник.новаРезультатМестнойДоставки.ВыполненаЧастично))
	|				И ЗакрытиеЗаказовЗаказы.Закрыть
	|			ТОГДА 1
	|		КОГДА ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНеВыполненияДоставки.ПереносСЗаездом)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Экспедитор <> ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка КАК Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки КАК НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация КАК Заказ,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа КАК ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Водитель КАК Сотрудник,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки КАК РезультатДоставки,
	|	ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения КАК ПричинаНевыполнения,
	|	1 КАК ЗаказНомер
	|ПОМЕСТИТЬ втЗаказыВсе
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Водитель <> ЗНАЧЕНИЕ(Справочник.новаВодители.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &Терминал
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеЗаказовЗаказы.Ссылка,
	|	ЗакрытиеЗаказовЗаказы.НомерСтроки,
	|	ЗакрытиеЗаказовЗаказы.Реализация,
	|	ЗакрытиеЗаказовЗаказы.ТипЗаказа,
	|	ЗакрытиеЗаказовЗаказы.Экспедитор,
	|	ЗакрытиеЗаказовЗаказы.РезультатДоставки,
	|	ЗакрытиеЗаказовЗаказы.ПричинаНевыполнения,
	|	1
	|ИЗ
	|	Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовЗаказы.Ссылка.ДатаЗакрытия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
	|			ИЛИ ЗакрытиеЗаказовЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт))
	|	И ЗакрытиеЗаказовЗаказы.Экспедитор <> ЗНАЧЕНИЕ(Справочник.новаЭкспедиторы.ПустаяСсылка)
	|	И ЗакрытиеЗаказовЗаказы.Ссылка.ТерминалДоставки = &Терминал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыВыполненные.Сотрудник КАК Сотрудник,
	|	СУММА(втЗаказыВыполненные.ВыполненныйЗаказ) КАК ВыполненныеЗаказы
	|ПОМЕСТИТЬ втИтогВыполненные
	|ИЗ
	|	втЗаказыВыполненные КАК втЗаказыВыполненные
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыВыполненные.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказыВсе.Сотрудник КАК Сотрудник,
	|	СУММА(втЗаказыВсе.ЗаказНомер) КАК ВсегоЗаказов
	|ПОМЕСТИТЬ втИтогВсе
	|ИЗ
	|	втЗаказыВсе КАК втЗаказыВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗаказыВсе.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мгЗарплатаНачисленияОстатки.Сотрудник КАК Сотрудник,
	|	СУММА(мгЗарплатаНачисленияОстатки.ТарифОстаток) КАК ВсегоНачислено
	|ПОМЕСТИТЬ втВсегоНачислено
	|ИЗ
	|	РегистрНакопления.мгЗарплатаНачисления.Остатки(
	|			&КонецПериода,
	|			ВЫБОР
	|				КОГДА &ОтборТерминала
	|					ТОГДА Терминал = &Терминал
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК мгЗарплатаНачисленияОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	мгЗарплатаНачисленияОстатки.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтогВсе.Сотрудник КАК Сотрудник,
	|	втИтогВыполненные.ВыполненныеЗаказы / втИтогВсе.ВсегоЗаказов КАК ПроцентВыполнения,
	|	втВсегоНачислено.ВсегоНачислено КАК ВсегоНачислено,
	|	ВЫБОР
	|		КОГДА втИтогВыполненные.ВыполненныеЗаказы / втИтогВсе.ВсегоЗаказов < 0.85
	|			ТОГДА втВсегоНачислено.ВсегоНачислено * 0.1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Депримирование
	|ПОМЕСТИТЬ втИтог
	|ИЗ
	|	втИтогВсе КАК втИтогВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВсегоНачислено КАК втВсегоНачислено
	|		ПО втИтогВсе.Сотрудник = втВсегоНачислено.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИтогВыполненные КАК втИтогВыполненные
	|		ПО втИтогВсе.Сотрудник = втИтогВыполненные.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРаботники.Сотрудник КАК Сотрудник,
	|	втИтог.Депримирование КАК Сумма,
	|	втРаботники.Организация КАК Организация
	|ИЗ
	|	втРаботники КАК втРаботники
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтог КАК втИтог
	|		ПО втРаботники.Сотрудник = втИтог.Сотрудник
	|ГДЕ
	|	втИтог.Депримирование <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	втРаботники.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Терминал", Объект.Терминал);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Если ЗначениеЗаполнено(Объект.Терминал) Тогда
		Запрос.УстановитьПараметр("ОтборТерминала", Истина);
	Иначе 
		Запрос.УстановитьПараметр("ОтборТерминала", Ложь);
	КонецЕсли;
	Результат = Запрос.Выполнить();
	Объект.Данные.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(МесяцСтрока, Объект.ПериодРегистрации);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	
	// Заполним реквизит формы МесяцСтрока.
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(ТекущиеДанные.Сотрудник);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			ТекущиеДанные.Организация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриИзменении(Элемент)
	Объект.Данные.Сортировать("Сотрудник");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры
